# Tap repos
tap "fwartner/tap"
tap "ngrok/ngrok"
tap "majd/repo"
tap "facebook/fb"

# Install packages
brew "git"
brew "git-delta"
brew "node"
brew "nvm"
brew "watchman"
brew "cocoapods"
brew "rbenv"
brew "cmake"
brew "ffmpeg"
brew "ios-deploy"
brew "xcbeautify"
brew "neofetch"
brew "stow"

# Install casks
cask "raycast"                      # Spotlight replacement
cask "cleanshot"                    # Screen recording and screenshots
cask "todoist"                      # Personal TODOs
cask "discord"                      # OSS
cask "minisim"                      # Easy open simulators
cask "devcleaner"                   # Clean up Xcode derived data and simulators
cask "muzzle"                       # Mute notifications when screen sharing
cask "ngrok"                        # For local tunneling
cask "font-fira-code"               # Font for coding
cask "zulu@17"                      # Java 17 for Android development
cask "ipatool"                      # Install iOS apps from the command line
cask "karabiner-elements"           # Keyboard customizer
cask "xcodes"                       # Manage Xcode versions
cask "ghostty"                      # Better Terminal
cask "dockdoor"                     # Better Alt-Tab
cask "handy"                        # Speech-to-text
cask "deskpad"                      # Virtual desktop for screen sharing
cask "scroll-reverser"              # Reverse scroll direction for mouse and trackpad independently
cask "zed"                          # IDE
cask "android-studio"               # Slow AF

# Install Mac App Store apps
mas "Bitwarden", id: 1352778147
