# Tap repos
tap "fwartner/tap"
tap "ngrok/ngrok"
tap "majd/repo"

# Install packages
brew "git"
brew "node"
brew "nvm"
brew "yarn"
brew "watchman"
brew "cocoapods"
brew "rbenv"
brew "cmake"
brew "ffmpeg"
brew "ios-deploy"
brew "xcbeautify"
brew "ipatool"
brew "fwartner/tap/mac-cleanup"
brew "neofetch"
brew "stow"

# Install casks
cask "arc"
cask "zed"
cask "bitwarden"
cask "raycast"
cask "cleanshot"
cask "whatsapp"
cask "todoist"
cask "discord"
cask "minisim"
cask "devcleaner"
cask "muzzle"
cask "ngrok"
cask "font-fira-code"
