# Tap repos
tap "fwartner/tap"
tap "ngrok/ngrok"
tap "majd/repo"
tap "facebook/fb"

# Install packages
brew "git"
brew "git-delta"
brew "node"
brew "nvm"
brew "yarn"
brew "watchman"
brew "cocoapods"
brew "rbenv"
brew "cmake"
brew "ffmpeg"
brew "ios-deploy"
brew "xcbeautify"
brew "fwartner/tap/mac-cleanup"
brew "neofetch"
brew "stow"
brew "idb-companion"
brew "scroll-reverser"
brew "deskpad"

# Install casks
cask "arc"
cask "zed"
cask "bitwarden"
cask "raycast"
cask "cleanshot"
cask "whatsapp"
cask "todoist"
cask "discord"
cask "slack"
cask "minisim"
cask "devcleaner"
cask "muzzle"
cask "ngrok"
cask "font-fira-code"
cask "zulu@17"
cask "ipatool"
cask "logi-options-plus"
cask "elgato-stream-deck"
cask "flipper"
cask "karabiner-elements"
cask "xcodes"